notes/database/impala.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Impala related notes</title>
<!-- 2013-07-03 Wed 22:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="erlv"/>
</head>
<body>
<div id="content">
<h1 class="title">Impala related notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The Design of Impala</a></li>
<li><a href="#sec-2">2. The Implementation of Impala</a></li>
<li><a href="#sec-3">3. Impala Build on Debian Wheezy(7.0)</a>
<ul>
<li><a href="#sec-3-1">3.1. netdb.h: reference to 'addrinfo' is ambiguous</a></li>
<li><a href="#sec-3-2">3.2. bzlib.h: no such file or directory</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Impala Runing on Debian Wheezy(7.0)</a>
<ul>
<li><a href="#sec-4-1">4.1. start-impalad.sh throw 'unsupported file system' error</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The Design of Impala</h2>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Implementation of Impala</h2>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Impala Build on Debian Wheezy(7.0)</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://github.com/cloudera/impala/blob/master/README.md">Official Impala Installation Guide</a>
</li>
</ul>
</div>


<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> netdb.h: reference to 'addrinfo' is ambiguous</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The full output of the problem:
</p>



<blockquote>
<p>
[  2%] Building CXX object be/src/common/CMakeFiles/Common.dir/status.cc.o
&#x2026;
In file included from impala-ir.cc:21:
In file included from /home/erlv/projects/databases/impala/be/src/exec/aggregation-node-ir.cc:19:
In file included from /home/erlv/projects/databases/impala/be/src/runtime/runtime-state.h:30:
In file included from /home/erlv/projects/databases/impala/be/src/runtime/exec-env.h:25:
In file included from /home/erlv/projects/databases/impala/be/src/runtime/client-cache.h:27:
In file included from /home/erlv/projects/databases/impala/be/src/util/thrift-client.h:29:
/home/erlv/projects/databases/impala/thirdparty/glog-0.3.2/src/glog/logging.h:472:9In file included from :impala-ir.cc: warning: 21:
In file included from /home/erlv/projects/databases/impala/be/src/exec/aggregation-node-ir.cc:19:
In file included from /home/erlv/projects/databases/impala/be/src/runtime/runtime-state.h:30:
In file included from /home/erlv/projects/databases/impala/be/src/runtime/exec-env.h:25:
In file included from /home/erlv/projects/databases/impala/be/src/runtime/client-cache.h:27:
In file included from /home/erlv/projects/databases/impala/be/src/util/thrift-client.h:33:
In file included from /home/erlv/projects/databases/impala/be/src/util/thrift-server.h:23:
In file included from /home/erlv/projects/databases/impala/thirdparty/thrift-0.9.0/build/include/thrift/server/TNonblockingServer.h:40:
In file included from /usr/include/event.h:57:
In file included from /usr/include/evutil.h:37:
In file included from /usr/include/event2/util.h:63:
<i>usr/include/netdb.h:587:16: error: reference to 'addrinfo' is ambiguous
  const struct addrinfo <b>ar<sub>request</sub>; /</b> Additional request specification.  *</i>
               ^
/usr/include/netdb.h:569:8: note: candidate found by name lookup is 'addrinfo'
struct addrinfo
       ^
/home/erlv/projects/databases/impala/thirdparty/thrift-0.9.0/build/include/thrift/transport/TSocket.h:244:30: note: candidate found by name
      lookup is 'apache::thrift::transport::addrinfo'
  void openConnection(struct addrinfo *res);
</p>
</blockquote>

<p>
Download Package from <a href="http://packages.ubuntu.com/precise/libevent1-dev">Ubuntu Package site</a>:
</p>
<ul class="org-ul">
<li>libevent
</li>
<li>libevent-core
</li>
<li>libevent-extra
</li>
<li>libevent-dev
</li>
</ul>

<p>
Use <code>dpkg -i</code> to install them. 
<b>Do not install the Debian default libevent-dev, it is v2.0, and does not support by thrift</b>
</p>


<p>
DONE!
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> bzlib.h: no such file or directory</h3>
<div class="outline-text-3" id="text-3-2">
<blockquote>
<p>
sudo apt-get install libbz2-dev 
</p>
</blockquote>

<p>
After install libbz2-dev, the problem is solved.
</p>

<p>
Done!
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Impala Runing on Debian Wheezy(7.0)</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> start-impalad.sh throw 'unsupported file system' error</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The error is as following:
</p>


<blockquote>
<p>
E0605 21:59:23.665810   772 impala-server.cc:648] Unsupported file system. Impala only supports DistributedFileSystem but the LocalFileSystem was found. fs.defaultFS(<a href="file:////">file:////</a>) might be set incorrectly
E0605 21:59:23.666024   772 impala-server.cc:650] Impala is aborted due to improper configurations.
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: erlv</p>
<p class="date">Created: 2013-07-03 Wed 22:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.0.3)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
